Repository: WarsawYing/FilmCutter
Catalog: FilmCutterApp/Sources/Resources/Localizable.xcstrings
Source language: en
Languages: es, fr, ja, zh_hans

# frame.geometry.warning
source: Some frames overlap. Check them before export.
es: Hay fotogramas solapados. Revísalos antes de exportar.
fr: Certaines vues se chevauchent. Vérifiez-les avant l’export.
ja: 重なっているコマがあります。書き出し前に確認してください。
zh_hans: 部分画格重叠，请在导出前检查。

# reorder.frames
source: Renumber frames in reading order
es: Renumerar fotogramas en orden de lectura
fr: Renuméroter les vues dans l’ordre de lecture
ja: 読み順にコマ番号を付け直す
zh_hans: 按画格阅读顺序重新编号

# ERR_ENGINE
source: The embedded processing engine failed.
es: Falló el motor de procesamiento integrado.
fr: Le moteur de traitement intégré a échoué.
ja: 内蔵処理エンジンでエラーが発生しました。
zh_hans: 内置处理引擎运行失败。

# ERR_NO_FRAMES
source: No frames were detected. Add a frame manually or update detection.
es: No se detectaron fotogramas. Añade uno manualmente o actualiza la detección.
fr: Aucune vue détectée. Ajoutez-en une manuellement ou relancez la détection.
ja: コマを検出できませんでした。手動で追加するか再検出してください。
zh_hans: 未检测到画格，请手动添加或更新检测。

# ERR_NO_INPUT
source: No TIFF input was provided.
es: No se ha indicado ningún TIFF.
fr: Aucun TIFF n’a été fourni.
ja: TIFFスキャンが選択されていません。
zh_hans: 没有提供 TIFF 扫描稿。

# ERR_OUTPUT_COLLISION
source: Output files already exist. Change the roll name or output folder.
es: Ya existen archivos de salida. Cambia el nombre del carrete o la carpeta.
fr: Des fichiers de sortie existent déjà. Modifiez le nom ou le dossier.
ja: 同名の出力ファイルがあります。ロール名または出力先を変更してください。
zh_hans: 输出文件已存在，请更换胶卷名称或输出位置。

# ERR_PREVIEW_PARTIAL
source: One or more scans could not be previewed.
es: No se pudo previsualizar uno o más escaneos.
fr: Un ou plusieurs scans n’ont pas pu être prévisualisés.
ja: 一部のスキャンをプレビューできませんでした。
zh_hans: 部分扫描稿无法生成预览。

# ERR_PROCESS
source: Processing failed. No partial output was kept.
es: El proceso falló. No se conservó ninguna salida parcial.
fr: Le traitement a échoué. Aucun fichier partiel n’a été conservé.
ja: 処理に失敗しました。不完全な出力は保存されていません。
zh_hans: 处理失败，未保留不完整文件。

# PROGRESS_PREVIEW_COMPLETE
source: Preview ready
es: Vista previa lista
fr: Aperçu prêt
ja: プレビューの準備完了
zh_hans: 预览已生成

# PROGRESS_PREVIEW_FILE
source: Scanning %@
es: Detectando %@
fr: Détection de %@
ja: %@を検出中
zh_hans: 正在检测 %@

# PROGRESS_PROCESS_COMPLETE
source: Finishing TIFF files…
es: Terminando los TIFF…
fr: Finalisation des TIFF…
ja: TIFFを仕上げています…
zh_hans: 正在完成 TIFF 文件…

# PROGRESS_PROCESS_FILE
source: Processing %@
es: Procesando %@
fr: Traitement de %@
ja: %@を処理中
zh_hans: 正在处理 %@

# PROGRESS_START
source: Starting…
es: Preparando…
fr: Préparation…
ja: 準備中…
zh_hans: 正在准备…

# about
source: About FilmCutter
es: Acerca de FilmCutter
fr: À propos de FilmCutter
ja: FilmCutterについて
zh_hans: 关于 FilmCutter

# about.description
source: Cut scanned film strips into individual frames. Supports 8/16-bit TIFF scans.
es: Recorta película escaneada en fotogramas TIFF individuales.
fr: Découpe les films numérisés en vues TIFF individuelles.
ja: スキャンしたフィルムを1コマずつTIFFに切り出します。
zh_hans: 将胶片扫描稿裁切为独立画格。 支持 8/16 位 TIFF 扫描稿。

source: Aperture
es: Apertura
fr: Ouverture
ja: 絞り
zh_hans: 光圈

# approve
source: Continue with %d Frames →
es: Continuar con %d fotogramas →
fr: Continuer avec %d vues →
ja: %dコマで続ける →
zh_hans: 确认 %d 个画格并继续 →

source: Back
es: Atrás
fr: Retour
ja: 戻る
zh_hans: 返回

# back.adjust
source: Back to Adjustments
es: Volver a los ajustes
fr: Retour aux réglages
ja: 調整に戻る
zh_hans: 返回调整

# border
source: Border: %d px
es: Borde: %d px
fr: Bordure : %d px
ja: 余白：%d px
zh_hans: 边框：%d px

source: Camera
es: Cámara
fr: Appareil
ja: カメラ
zh_hans: 相机

source: Cancel
es: Cancelar
fr: Annuler
ja: キャンセル
zh_hans: 取消

source: Change…
es: Cambiar…
fr: Modifier…
ja: 変更…
zh_hans: 更改…

# complete
source: Successfully cut %d frames!
es: ¡%d fotogramas recortados!
fr: %d vues découpées !
ja: %dコマを書き出しました！
zh_hans: 已成功裁切 %d 个画格！

# confirm.reselect.message
source: Manual frame adjustments will be discarded.
es: Se descartarán los ajustes manuales actuales.
fr: Les réglages manuels actuels seront supprimés.
ja: 現在の手動調整は破棄されます。
zh_hans: 现有的手动画格调整将被丢弃。

# confirm.reselect.title
source: Choose different input?
es: ¿Elegir otra entrada?
fr: Changer d’entrée ?
ja: 入力を選び直しますか？
zh_hans: 重新选择输入？

source: Contributors
es: Colaboradores
fr: Contributeurs
ja: コントリビューター
zh_hans: 贡献者

source: Date
es: Fecha
ja: 日付
zh_hans: 日期

source: Depth
es: Profundidad
fr: Profondeur
ja: ビット深度
zh_hans: 位深

# drop.subtitle
source: Drop one TIFF file or a folder for batch processing
es: Suelta un TIFF o una carpeta para procesarla por lotes
fr: Déposez un TIFF ou un dossier pour le traitement par lot
ja: TIFFファイルまたは一括処理するフォルダをドロップ
zh_hans: 拖入一个 TIFF 文件，或拖入文件夹进行批量处理

# drop.title
source: Drop a scanned film TIFF here
es: Suelta aquí un TIFF de película escaneada
fr: Déposez ici un TIFF de film numérisé
ja: スキャンしたフィルムTIFFをドロップ
zh_hans: 将胶片扫描 TIFF 拖到这里

# expected.count
source: Expected frames (optional)
es: Fotogramas esperados (opcional)
fr: Vues attendues (facultatif)
ja: 想定コマ数（任意）
zh_hans: 预期画格数（可选）

# expected.found
source: Expected %d / Found %d
es: Esperados %d / Encontrados %d
fr: %d attendues / %d détectées
ja: 想定 %d / 検出 %d
zh_hans: 预期 %d / 找到 %d

# experimental.refine
source: Experimental boundary refinement
es: Ajuste experimental de bordes
fr: Affinage expérimental des bords
ja: 実験的な境界補正
zh_hans: 实验性边界细化

# export
source: Cut %d Frames →
es: Recortar %d fotogramas →
fr: Découper %d vues →
ja: %dコマを書き出す →
zh_hans: 裁切 %d 个画格 →

source: File
es: Archivo
fr: Fichier
ja: ファイル
zh_hans: 文件

source: Filename Preview
es: Vista previa del nombre
fr: Aperçu du nom
ja: ファイル名プレビュー
zh_hans: 文件名预览

source: Film Format
es: Formato de película
fr: Format de film
ja: フィルムフォーマット
zh_hans: 胶片格式

source: Film Stock
es: Película
fr: Pellicule
ja: フィルム銘柄
zh_hans: 胶卷型号

# format.135
source: 135 Full Frame (24×36)
es: 135 completo (24×36)
fr: 135 plein format (24×36)
ja: 135 フルサイズ（24×36）
zh_hans: 135 全格（24×36）

# format.135_half
source: 135 Half Frame (18×24)
es: 135 medio formato (18×24)
fr: 135 demi-format (18×24)
ja: 135 ハーフ（18×24）
zh_hans: 135 半格（18×24）

# format.auto
source: Auto
es: Automático
fr: Automatique
ja: 自動
zh_hans: 自动

# found.frames
source: Found %d
es: %d fotogramas encontrados
fr: %d vues détectées
ja: %dコマ検出
zh_hans: 找到 %d 个画格

# found.frames.one
source: Found %d frame
es: %d fotograma encontrado
fr: %d vue détectée
ja: %dコマ検出
zh_hans: 找到 %d 个画格

# found.frames.other
source: Found %d frames
es: %d fotogramas encontrados
fr: %d vues détectées
ja: %dコマ検出
zh_hans: 找到 %d 个画格

source: Frames
es: Fotogramas
fr: Vues
ja: コマ
zh_hans: 画格

source: Lens
es: Objetivo
fr: Objectif
ja: レンズ
zh_hans: 镜头

source: License
es: Licencia
fr: Licence
ja: ライセンス
zh_hans: 许可证

source: Manual adjustments
es: Ajustes manuales
fr: Réglages manuels
ja: 手動調整あり
zh_hans: 已手动调整

# metadata
source: Roll Metadata
es: Datos del carrete
fr: Informations de la pellicule
ja: ロール情報
zh_hans: 胶卷资料

# name.required
source: Enter a roll name
es: Introduce un nombre para el carrete
fr: Saisissez un nom de pellicule
ja: ロール名を入力してください
zh_hans: 请输入胶卷名称

# negative
source: Negative (invert)
es: Negativo (invertir)
fr: Négatif (inverser)
ja: ネガ（反転）
zh_hans: 负片（反相）

source: Next
es: Siguiente
fr: Suivant
ja: 次へ
zh_hans: 下一张

source: Notes
es: Notas
ja: メモ
zh_hans: 备注

# open.output
source: Open Output Folder
es: Abrir carpeta de salida
fr: Ouvrir le dossier de sortie
ja: 出力フォルダを開く
zh_hans: 打开输出文件夹

source: Output
es: Destino
fr: Destination
ja: 出力先
zh_hans: 输出位置

# positive
source: Positive (keep)
es: Positivo (conservar)
fr: Positif (conserver)
ja: ポジ（維持）
zh_hans: 正片（保持）

source: Previous
es: Anterior
fr: Précédent
ja: 前へ
zh_hans: 上一张

source: Process Another
es: Procesar otro carrete
fr: Traiter une autre pellicule
ja: 別のロールを処理
zh_hans: 处理另一卷

# processing
source: Cutting frames…
es: Recortando fotogramas…
fr: Découpe en cours…
ja: コマを書き出しています…
zh_hans: 正在裁切画格…

source: Push/Pull
es: Forzado
ja: 増感／減感
zh_hans: 增感/减感

# refine.geometry_guard
source: Refinement reverted to preserve frame geometry.
es: Se restauraron los bordes originales para conservar la geometría.
fr: Retour aux bords d’origine pour préserver la géométrie.
ja: コマ形状を保つため元の検出境界に戻しました。
zh_hans: 为保持画格比例，已恢复原检测边界。

# refine.no_frames
source: Refinement skipped: no frames were found.
es: No se ajustaron los bordes porque no se encontraron fotogramas.
fr: Affinage ignoré : aucune vue détectée.
ja: コマがないため境界補正を省略しました。
zh_hans: 未找到画格，已跳过边界细化。

# refine.no_score_improvement
source: The stable detection boundaries were already better.
es: Los bordes originales ya eran mejores.
fr: Les bords d’origine étaient déjà meilleurs.
ja: 元の検出境界の方が適切です。
zh_hans: 原检测边界已经更好。

# refine.overlap_guard
source: Refinement reverted to prevent overlapping frames.
es: Se restauraron los bordes originales para evitar solapamientos.
fr: Retour aux bords d’origine pour éviter le chevauchement.
ja: 重なりを防ぐため元の検出境界に戻しました。
zh_hans: 为防止画格重叠，已恢复原检测边界。

source: Replace
es: Sustituir
fr: Remplacer
ja: 置き換える
zh_hans: 替换

# replace.message
source: Automatic detection will replace manual edits for the selected scan scope.
es: La detección automática sustituirá los ajustes manuales del ámbito elegido.
fr: La détection automatique remplacera les réglages manuels pour la portée choisie.
ja: 自動検出により、選択範囲の手動調整が置き換えられます。
zh_hans: 自动检测会替换所选范围内的手动画格调整。

# replace.title
source: Replace manual adjustments?
es: ¿Sustituir los ajustes manuales?
fr: Remplacer les réglages manuels ?
ja: 手動調整を置き換えますか？
zh_hans: 替换手动调整？

source: Roll Name
es: Nombre del carrete
fr: Nom de la pellicule
ja: ロール名
zh_hans: 胶卷名称

# roll.placeholder
source: e.g. Paris2026
es: p. ej., Madrid2026
fr: ex. Paris2026
ja: 例：Tokyo2026
zh_hans: 例如：上海2026

# scan.info
source: Scan %d of %d
es: Escaneo %d de %d
fr: Scan %d sur %d
ja: スキャン %d / %d
zh_hans: 扫描稿 %d / %d

source: Scanner
es: Escáner
ja: スキャナー
zh_hans: 扫描仪

# scope.all
source: All Scans
es: Todos
fr: Tous les scans
ja: すべてのスキャン
zh_hans: 全部扫描稿

# scope.current
source: Current Scan
es: Escaneo actual
fr: Scan actuel
ja: 現在のスキャン
zh_hans: 当前扫描稿

source: Select File…
es: Elegir archivo…
fr: Choisir un fichier…
ja: ファイルを選択…
zh_hans: 选择文件…

source: Select Folder…
es: Elegir carpeta…
fr: Choisir un dossier…
ja: フォルダを選択…
zh_hans: 选择文件夹…

# select.input.again
source: Choose Different Input
es: Elegir otra entrada
fr: Changer d’entrée
ja: 入力を選び直す
zh_hans: 重新选择输入

source: Size
es: Tamaño
fr: Dimensions
ja: サイズ
zh_hans: 尺寸

source: Source
es: Código fuente
fr: Code source
ja: ソース
zh_hans: 源代码

# stage.adjust
source: Preview & Adjust
es: Vista previa y ajuste
fr: Aperçu et réglage
ja: プレビューと調整
zh_hans: 预览与调整

# stage.export
source: Export Confirmation
es: Confirmar exportación
fr: Confirmation d’export
ja: 書き出し確認
zh_hans: 导出确认

# stage.import
source: Import
es: Importar
fr: Importer
ja: 読み込み
zh_hans: 导入

# third.party
source: Third-Party Notices
es: Avisos de terceros
fr: Mentions tierces
ja: 第三者ライセンス
zh_hans: 第三方声明

source: Today
es: Hoy
fr: Aujourd’hui
ja: 今日
zh_hans: 今天

source: Try Again
es: Intentar de nuevo
fr: Réessayer
ja: もう一度試す
zh_hans: 重试

source: Update Detection
es: Actualizar detección
fr: Relancer la détection
ja: 再検出
zh_hans: 更新检测

# update.scope
source: Apply to
es: Aplicar a
fr: Appliquer à
ja: 適用範囲
zh_hans: 应用范围

source: Error
fr: Erreur
ja: エラー
zh_hans: 错误
